// pages/m_question/m_question.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    prompt:[
      "订单如含赠品，退货时若不满赠送条件需将赠品一同退回；如赠品已经拆封或食用，将不予退换货；",
      "与售后客服沟通后，所有符合退",
      "订单如含赠品，退货时若不满赠送条件需将赠品一同退回；如赠品已经拆封或食用，将不予退换货；",
      "订单如含赠品，退货时若不满赠送条件需将赠品一同退回；如赠品已经拆封或食用，将不予退换货；"
    ],
    question:[
      {
        id:1,
        title:"申请售后的方式有哪些？",
        answer:[
          {
            title:"一键申请售后",
            content:"在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          }
        ]
      },
      {
        id:2,
        title: "下订单后，突然不想要了可以退吗？",
        answer: [
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          }
        ]
      },
      {
        id: 3,
        title: "什么情况下可以退换货？",
        answer: [
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          }
        ]
      },
      {
        id: 4,
        title: "什么情况下不可以退换货？",
        answer: [
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          }
        ]
      },
      {
        id: 5,
        title: "退款什么时候可以到账？",
        answer: [
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          },
          {
            title: "一键申请售后",
            content: "在商品签收后的12小时内，如发现商品质量问题，可进入【待评价】→点击查看商品订单详情→点击“申请售后”按钮，"
          }
        ]
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  },

  /**
   * 展示解答方法
   */
  showAnswer:function(e){
    for(var i=0;i<this.data.question.length;i++){
      if (e.currentTarget.dataset.index ==i){
        this.setData({
          show_answer:(this.data.show_answer==i?'':i)
        })
      }
    }
  }
})